"""Данная программа предназначена для поиска телефонных номеров международного
формата в тексте web-страниц. Используемый инструмент  –  регулярные выражения.

При   запуске  в  качестве  параметра  можно  передать  имя  текстового  файла
со ссылками на web-страницы (одна ссылка — одна строка).

"""
import re
import os
import sys

import requests

TIMEOUT = 10
DEFAULT_FILENAME = 'phones.txt'
PHONE_RE = re.compile(r'\D(\+(999|998|997|996|995|994|993|992|991|'
                      r'990|979|978|977|976|975|974|973|972|971|970|'
                      r'969|968|967|966|965|964|963|962|961|960|899|'
                      r'898|897|896|895|894|893|892|891|890|889|888|'
                      r'887|886|885|884|883|882|881|880|879|878|877|'
                      r'876|875|874|873|872|871|870|859|858|857|856|'
                      r'855|854|853|852|851|850|839|838|837|836|835|'
                      r'834|833|832|831|830|809|808|807|806|805|804|'
                      r'803|802|801|800|699|698|697|696|695|694|693|'
                      r'692|691|690|689|688|687|686|685|684|683|682|'
                      r'681|680|679|678|677|676|675|674|673|672|671|'
                      r'670|599|598|597|596|595|594|593|592|591|590|'
                      r'509|508|507|506|505|504|503|502|501|500|429|'
                      r'428|427|426|425|424|423|422|421|420|389|388|'
                      r'387|386|385|384|383|382|381|380|379|378|377|'
                      r'376|375|374|373|372|371|370|359|358|357|356|'
                      r'355|354|353|352|351|350|299|298|297|296|295|'
                      r'294|293|292|291|290|289|288|287|286|285|284|'
                      r'283|282|281|280|269|268|267|266|265|264|263|'
                      r'262|261|260|259|258|257|256|255|254|253|252|'
                      r'251|250|249|248|247|246|245|244|243|242|241|'
                      r'240|239|238|237|236|235|234|233|232|231|230|'
                      r'229|228|227|226|225|224|223|222|221|220|219|'
                      r'218|217|216|215|214|213|212|211|210|98|95|94|'
                      r'93|92|91|90|86|84|82|81|66|65|64|63|62|61|60|'
                      r'58|57|56|55|54|53|52|51|49|48|47|46|45|44|43|'
                      r'41|40|39|36|34|33|32|31|30|27|20|7|1)\d{1,14})\D')

# Получаем список телефонных номеров для одной web-страницы
def retrieve_phones(url: str, show_hint=True) -> list:
    if show_hint:
        print(f'Обрабатывается url "{url}":')

    try:
        r = requests.get(url, timeout=TIMEOUT)
    except requests.exceptions.RequestException:
        print('Ошибка: не удалось выполнить http-запрос.\n')
        return []

    if r.status_code == requests.codes.ok:
        # Получаем текст web-страницы и сразу 'подчищаем' его
        html = r.text.replace(' ', '').replace('-', '')
        search_results = re.findall(PHONE_RE, html)

        phones = []
        for result in search_results:
            if result[0] not in phones:
                phones.append(result[0])

        phones.sort()
        for phone in phones:
            print(f"\t{phone}")
        print(f'Телефонных номеров получено: {len(phones)}.\n')

        return phones
    else:
        print(f'Ошибка {r.status_code} при обращении к web-странице.\n')
        return []

phones = []

# Если в командной строке передано имя файла, то пробуем его загрузить
# В противном случае имя файла запрашиваем у пользователя
if len(sys.argv) > 1:
    filename = sys.argv[1]
    try:
        with open(filename) as f:
            urls = f.readlines()
    except FileNotFoundError:
        print('Неверное имя входного файла или нет прав доступа!')
        exit()

    for url in urls:
        phones.extend(retrieve_phones(url.strip()))
    phones.sort()

    print(f'Итого телефонных номеров: {len(phones)}.\n')
else:
    print('Введите url для обработки:')
    url = input().strip()
    phones = retrieve_phones(url, show_hint=False)

# Сохраняем результаты парсинга
if phones:
    print('Введите имя файла для сохранения данных\n'
          '(Enter - ввод имени по умолчанию):')
    filename = input().strip() or DEFAULT_FILENAME

    try:
        with open(filename, 'w') as f:
            f.writelines([phone + '\n' for phone in phones])
    except OSError:
        print('Ошибка: не удалось записать данные в файл.')
    else:
        print('Данные успешно записаны.')
        os.startfile(filename)
else:
    print('Телефонные номера не обнаружены, работа программы завершена.')
